#!/usr/bin/env python

TITLE = """
\033[1;33m
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
+                           堡垒机V2.0                          +
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
\033[0m
"""

LOGIN_MENU = """
\033[1;33m
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
+                                                               +
+                           堡垒机 V2.0                         +
+                                                Author:super   +
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
用户:{user}    角色:{role}    上次登录时间:{date}
\033[0m\n
"""

ADMIN_MENU = [
    {"1": {"showmsg": "添加主机组", "module": "add_group"}},
    {"2": {"showmsg": "添加主机", "module": "add_host"}},
    {"3": {"showmsg": "添加主机用户", "module": "add_host_user"}},
    {"4": {"showmsg": "添加系统用户", "module": "add_login_user"}},
    ]